S1Сtest/src/Documents/ЗаявлениеНаПредоставлениеГосуслуги/ЗаявлениеНаПредоставлениеГосуслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявлениеНаПредоставлениеГосуслуги</name>
  <attributes>
    <name>ГосУслуга</name>
    <type>
      <types>CatalogRef.ГосУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПоступленияЗаявления</name>
    <type>
      <types>CatalogRef.КаналыПоступленияЗаявлений</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателя</name>
    <type>
      <types>EnumRef.КатегорияПолучателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляЗаявления</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидПоляЗаявления</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоля</name>
      <type>
        <types>Characteristic.ВидПоляЗаявления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

S1Сtest/src/Documents/ЗаявлениеНаПредоставлениеГосуслуги/ManagerModule.bsl
Функция ЗначениеПоляЗаявления(Заявление, ВидПоля) Экспорт
	
	Если ТипЗнч(Заявление) = Тип("ДокументСсылка.ЗаявлениеНаПредоставлениеГосуслуги") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заявление", Заявление);
		Запрос.УстановитьПараметр("ВидПоля", ВидПоля);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявлениеНаПредоставлениеГосуслугиПоляЗаявления.ЗначениеПоля КАК ЗначениеПоля
		|ИЗ
		|	Документ.ЗаявлениеНаПредоставлениеГосуслуги.ПоляЗаявления КАК ЗаявлениеНаПредоставлениеГосуслугиПоляЗаявления
		|ГДЕ
		|	ЗаявлениеНаПредоставлениеГосуслугиПоляЗаявления.Ссылка = &Заявление
		|	И ЗаявлениеНаПредоставлениеГосуслугиПоляЗаявления.Поле = &ВидПоля";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ЗначениеПоля;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Заявление) = Тип("ДокументОбъект.ЗаявлениеНаПредоставлениеГосуслуги") Тогда
		
		НайденныеСтроки = Заявление.ПоляЗаявления.НайтиСтроки(Новый Структура("Поле", ВидПоля));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0].ЗначениеПоля;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции
